# 190031177
# Navneet Kumar Singh

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
list = ['a','b','c','d']
series = pd.Series(list)
print(series)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
d =['aditya','aayush','dheer','rithik','navneet'];
m=[[21,22,23,24],[22,25,24,26],[12,22,45,65],[78,88,98,75],[45,46,78,95]]
s=['ds','mp2','ai','PFSD']

In [ ]:
df = pd.DataFrame(data=m,index=d,columns=s)

In [ ]:
df

         ds  mp2  ai  PFSD
aditya   21   22  23    24
aayush   22   25  24    26
dheer    12   22  45    65
rithik   78   88  98    75
navneet  45   46  78    95

In [ ]:
df['TS']=df['ds']+df['mp2']+df['ai']+df['PFSD']

In [ ]:
df

         ds  mp2  ai  PFSD   TS
aditya   21   22  23    24   90
aayush   22   25  24    26   97
dheer    12   22  45    65  144
rithik   78   88  98    75  339
navneet  45   46  78    95  264

In [ ]:
 z=df.iloc[1: , :2]

In [ ]:
z

         ds  mp2
aayush   22   25
dheer    12   22
rithik   78   88
navneet  45   46

In [ ]:
df['SPI'] = df['ds'] + df['ai']

In [ ]:
df

         ds  mp2  ai  PFSD   TS  SPI
aditya   21   22  23    24   90   44
aayush   22   25  24    26   97   46
dheer    12   22  45    65  144   57
rithik   78   88  98    75  339  176
navneet  45   46  78    95  264  123

In [ ]:
df[df['ds'] > 20]

         ds  mp2  ai  PFSD   TS  SPI
aditya   21   22  23    24   90   44
aayush   22   25  24    26   97   46
rithik   78   88  98    75  339  176
navneet  45   46  78    95  264  123

In [ ]:
sum(df['SPI'])

446

In [ ]:
csx = pd.read_csv('sample.csv')

In [ ]:
print(csx)

       Year Industry_aggregation_NZSIOC Industry_code_NZSIOC  \
0      2019                     Level 1                99999
1      2019                     Level 1                99999
2      2019                     Level 1                99999
3      2019                     Level 1                99999
4      2019                     Level 1                99999
...     ...                         ...                  ...
32440  2013                     Level 3                 ZZ11
32441  2013                     Level 3                 ZZ11
32442  2013                     Level 3                 ZZ11
32443  2013                     Level 3                 ZZ11
32444  2013                     Level 3                 ZZ11

             Industry_name_NZSIOC               Units Variable_code  \
0                  All industries  Dollars (millions)           H01
1                  All industries  Dollars (millions)           H04
2                  All industries  Dollars (millions)           H05
3                  All industries  Dollars (millions)           H07
4                  All industries  Dollars (millions)           H08
...                           ...                 ...           ...
32440  Food product manufacturing          Percentage           H37
32441  Food product manufacturing          Percentage           H38
32442  Food product manufacturing          Percentage           H39
32443  Food product manufacturing          Percentage           H40
32444  Food product manufacturing          Percentage           H41

                                         Variable_name      Variable_category  \
0                                         Total income  Financial performance
1      Sales, government funding, grants and subsidies  Financial performance
2                    Interest, dividends and donations  Financial performance
3                                 Non-operating income  Financial performance
4                                    Total expenditure  Financial performance
...                                                ...                    ...
32440                                      Quick ratio       Financial ratios
32441              Margin on sales of goods for resale       Financial ratios
32442                                 Return on equity       Financial ratios
32443                           Return on total assets       Financial ratios
32444                            Liabilities structure       Financial ratios

          Value                             Industry_code_ANZSIC06
0      7,28,239  ANZSIC06 divisions A-S (excluding classes K633...
1      6,43,809  ANZSIC06 divisions A-S (excluding classes K633...
2        62,924  ANZSIC06 divisions A-S (excluding classes K633...
3        21,505  ANZSIC06 divisions A-S (excluding classes K633...
4      6,34,710  ANZSIC06 divisions A-S (excluding classes K633...
...         ...                                                ...
32440        52  ANZSIC06 groups C111, C112, C113, C114, C115, ...
32441        40  ANZSIC06 groups C111, C112, C113, C114, C115, ...
32442        12  ANZSIC06 groups C111, C112, C113, C114, C115, ...
32443         5  ANZSIC06 groups C111, C112, C113, C114, C115, ...
32444        46  ANZSIC06 groups C111, C112, C113, C114, C115, ...

[32445 rows x 10 columns]